* LEEME
** Para que sirve
Permite exportar un sitio web desde un directorio base indicado. Convirtiendo
los archivos con extensión *.org a html* y copiando este html, las imágenes y
los archivos css a un directorio de publicación.

Para esto ahora hay unas funciones a las que se les indica la carpeta base y la
de publicación y exportan html css e imagenes. Y la ultima funcion se compone de
las tres anteriores para llamarlas de una sola vez.

Si se utilizan enlaces relativos para la publicación como en la configuración,
hay que publicar desde este documento o cuanquier otro que este en la misma
carpeta.

*** Como publicar el sitio web
1. Evaluar las funciones para publicar con =C-c C-c= o =, ,=
2. Modificar segun necesidades la configuración de publicación y evaluar
3. Usar el publish dispatcher de org mode =M-m m e e P x=

** Funciones para publicar
#+begin_src emacs-lisp :results output silent
(defun gen-cfg (name io-dirs args ;; surname files-regex fn-publish
                     &optional extra)
  (let ((base-dir (if (not (string-equal (car args) "html"))
                      (concat (car io-dirs) (car args))
                    (car io-dirs)))
        (publish-dir (if (not (string-equal (car args) "html"))
                         (concat (cadr io-dirs) "/" (car args))
                       (cadr io-dirs))))
    (append `(,(concat name "-" (car args))
              :base-directory ,base-dir
              :base-extension ,(nth 1 args)
              :publishing-directory ,publish-dir
              :publishing-function ,(nth 2 args))
            extra)))

(defun gen-cfg-website (name)
   `(,(concat name "-website")
     :components (,(concat name "-html")
                  ,(concat name "-images"))))
#+end_src

** Configuración de publicación
Hay que configurar las variables org-re-reveal-root y org-re-reveal-version para
exportar con la version correcta de Reveal.js.
#+begin_src emacs-lisp
(setq public-dirs '("./org/" "./public_html"))
(setq pages-dirs '("/home/username/org-files/" "./public_html/pages"))

(setq html-args '("html" "org" org-html-publish-to-html))
(setq img-args '("images" "jpg\\|gif\\|png\\|svg" org-publish-attachment))
(setq css-args '("css" "css" org-publish-attachment))
(setq js-args '("scripts" "js" org-publish-attachment))
(setq reveal-args '("revealjs" "org" org-re-reveal-publish-to-reveal))

(setq org-html-postamble t)
(setq org-html-postamble-format
      `(("es" ,(concat
                "<p class=\"author\">Author: %a (%e)</p>\n"
                "<p class=\"creator\">%c</p>\n"
                "<p class=\"validation\">%v</p>\n"
                "<div class=\"scroll-up-btn\"><i></i></div>"))))

(setq main-extras
      '(:language "es"
        :exclude "private.org" :recursive nil
        :with-title t :with-date t :with-toc t

        :html-head-include-default-style nil
        :html-doctype "html5" :html-html5-fancy t :section-numbers nil
        :html-head-extra
         "<script src=\"https://code.jquery.com/jquery-3.6.0.min.js\" crossorigin=\"anonymous\"\"></script>"

        :auto-sitemap t :sitemap-title ""
        :sitemap-sort-files anti-chronologically
        :sitemap-file-entry-format "%d - %t"
        :sitemap-function org-publish-sitemap-default))

(setq link-a "<link rel=\"stylesheet\" href=\""
      link-c "\" type=\"text/css\"/>"
      scr-a "<script src=\""
      scr-c "\"></script>")

(setq public-extras
      (append main-extras
              (list :html-head (concat link-a "./css/style.css" link-c)
                    :html-head-extra (concat link-a "./css/org.css" link-c)
                    :html-head-extra (concat scr-a "./scripts/index.js" scr-c))))

(setq pages-extras
      (append main-extras
              (list :html-head (concat link-a "../css/style.css" link-c)
                    :html-head-extra (concat link-a "../css/org.css" link-c)
                    :html-head-extra (concat scr-a "../scripts/index.js" scr-c))))

(setq public-main (gen-cfg "public" public-dirs html-args public-extras))
(setq public-images (gen-cfg "public" public-dirs img-args))
(setq public-css (gen-cfg "public" public-dirs css-args))
(setq public-js (gen-cfg "public" public-dirs js-args))

(setq pages-main (gen-cfg "pages" pages-dirs html-args pages-extras))
(setq pages-images (gen-cfg "pages" pages-dirs img-args))
(setq pages-revealjs (gen-cfg "pages" pages-dirs reveal-args))

(setq org-publish-project-alist
      `(,public-main ,public-images ,public-css, public-js
        ,(gen-cfg-website "public" )

        ,pages-main ,pages-images ,pages-revealjs
        ,(gen-cfg-website "pages" )))
#+end_src

#+RESULTS:
| public-html    | :base-directory | ./org/                             | :base-extension | org  | :publishing-directory | ./public_html                | :publishing-function | org-html-publish-to-html        | :language                  | es                   | :exclude               | private.org | :recursive | nil | :with-title | t | :with-date | t | :with-toc | t | :html-head-include-default-style | nil | :html-doctype | html5 | :html-html5-fancy | t | :section-numbers | nil | :html-head-extra | <script src="https://code.jquery.com/jquery-3.6.0.min.js" crossorigin="anonymous""></script> | :auto-sitemap | t | :sitemap-title |   | :sitemap-sort-files | anti-chronologically | :sitemap-file-entry-format | %d - %t | :sitemap-function | org-publish-sitemap-default | :html-head | <link rel="stylesheet" href="./css/style.css" type="text/css"/>  | :html-head-extra | <link rel="stylesheet" href="./css/org.css" type="text/css"/>  | :html-head-extra | <script src="./scripts/index.js"></script>  |
| public-images  | :base-directory | ./org/images                       | :base-extension | jpg\ | gif\                  | png\                         | svg                  | :publishing-directory           | ./public_html/images       | :publishing-function | org-publish-attachment |             |            |     |             |   |            |   |           |   |                                  |     |               |       |                   |   |                  |     |                  |                                                                                              |               |   |                |   |                     |                      |                            |         |                   |                             |            |                                                                  |                  |                                                                |                  |                                             |
| public-css     | :base-directory | ./org/css                          | :base-extension | css  | :publishing-directory | ./public_html/css            | :publishing-function | org-publish-attachment          |                            |                      |                        |             |            |     |             |   |            |   |           |   |                                  |     |               |       |                   |   |                  |     |                  |                                                                                              |               |   |                |   |                     |                      |                            |         |                   |                             |            |                                                                  |                  |                                                                |                  |                                             |
| public-scripts | :base-directory | ./org/scripts                      | :base-extension | js   | :publishing-directory | ./public_html/scripts        | :publishing-function | org-publish-attachment          |                            |                      |                        |             |            |     |             |   |            |   |           |   |                                  |     |               |       |                   |   |                  |     |                  |                                                                                              |               |   |                |   |                     |                      |                            |         |                   |                             |            |                                                                  |                  |                                                                |                  |                                             |
| public-website | :components     | (public-html public-images)        |                 |      |                       |                              |                      |                                 |                            |                      |                        |             |            |     |             |   |            |   |           |   |                                  |     |               |       |                   |   |                  |     |                  |                                                                                              |               |   |                |   |                     |                      |                            |         |                   |                             |            |                                                                  |                  |                                                                |                  |                                             |
| pages-html     | :base-directory | /home/pi/Dropbox/org/Blog/         | :base-extension | org  | :publishing-directory | ./public_html/pages          | :publishing-function | org-html-publish-to-html        | :language                  | es                   | :exclude               | private.org | :recursive | nil | :with-title | t | :with-date | t | :with-toc | t | :html-head-include-default-style | nil | :html-doctype | html5 | :html-html5-fancy | t | :section-numbers | nil | :html-head-extra | <script src="https://code.jquery.com/jquery-3.6.0.min.js" crossorigin="anonymous""></script> | :auto-sitemap | t | :sitemap-title |   | :sitemap-sort-files | anti-chronologically | :sitemap-file-entry-format | %d - %t | :sitemap-function | org-publish-sitemap-default | :html-head | <link rel="stylesheet" href="../css/style.css" type="text/css"/> | :html-head-extra | <link rel="stylesheet" href="../css/org.css" type="text/css"/> | :html-head-extra | <script src="../scripts/index.js"></script> |
| pages-images   | :base-directory | /home/pi/Dropbox/org/Blog/images   | :base-extension | jpg\ | gif\                  | png\                         | svg                  | :publishing-directory           | ./public_html/pages/images | :publishing-function | org-publish-attachment |             |            |     |             |   |            |   |           |   |                                  |     |               |       |                   |   |                  |     |                  |                                                                                              |               |   |                |   |                     |                      |                            |         |                   |                             |            |                                                                  |                  |                                                                |                  |                                             |
| pages-revealjs | :base-directory | /home/pi/Dropbox/org/Blog/revealjs | :base-extension | org  | :publishing-directory | ./public_html/pages/revealjs | :publishing-function | org-re-reveal-publish-to-reveal |                            |                      |                        |             |            |     |             |   |            |   |           |   |                                  |     |               |       |                   |   |                  |     |                  |                                                                                              |               |   |                |   |                     |                      |                            |         |                   |                             |            |                                                                  |                  |                                                                |                  |                                             |
| pages-website  | :components     | (pages-html pages-images)          |                 |      |                       |                              |                      |                                 |                            |                      |                        |             |            |     |             |   |            |   |           |   |                                  |     |               |       |                   |   |                  |     |                  |                                                                                              |               |   |                |   |                     |                      |                            |         |                   |                             |            |                                                                  |                  |                                                                |                  |                                             |
